blogs/linux-terminal-shortcut.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-19 三 14:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>linux 终端快捷键</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">linux 终端快捷键</h1>
<p>
作为一个linux工程师，不是在终端输入，就是在编辑器输入。信手使用快捷键，别让“键程”束缚你的想象。这里主要总结终端的快捷键，如果你恰好是emacs用户，你会发现似曾相。当然，纵使你一个快捷键也不会，也不妨碍你自称高级工程师，架构师。
</p>

<p>
快捷键很多，怎么记得住，当然记不住。用多了，它就变成你身体的一部分。你问我咋把屏幕清空，我一时也回答不出。但当我把手放到键盘上，我自然的就打出了<code>CTRL l</code> ，然后我才知道，哦，原来是这个快捷键。
</p>

<p>
windows上用来连接linux服务器的终端很多，不是所有都可以顺畅的使用这些快捷键，可能需要一些配置。我推荐用cygwin。
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 约定</h2>
<div class="outline-text-2" id="text-1">
<p>
三个控制键分别用 <code>CTRL</code> <code>ALT</code> <code>SHIFT</code> 表示， <code>CTRL a</code> 表示 <code>CTRL</code> 和 <code>a</code> 键的组合，先摁控制键。
4个方向键分别用 <code>LEFT</code> <code>RIGHT</code> <code>TOP</code> <code>DOWN</code> 表示
Backspace键用 <code>BS</code> 表示，Delete键用 <code>DEL</code> 表示
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 快速移动光标</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>CTRL a</code> 移动光标到行首</li>
<li><code>CTRL e</code> 移动光标到行位</li>
<li><code>CTRL b</code> 向左移动光标，一次一个字符，相当于 <code>LEFT</code></li>
<li><code>CTRL f</code> 向右移动光标，一次一个字符，相当于 <code>RIGHT</code></li>
<li><code>ALT b</code>  向左移动光标，一次一个单词</li>
<li><code>ALT f</code>  向右移动光标，一次一个单词</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 快速编辑命令</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>CTRL k</code> 删除光标左边的所有字符</li>
<li><code>CTRL u</code> 删除光标右边的所有字符</li>
<li><code>CTRL d</code> 相当于 <code>DEL</code> 。如果命令行空了，还摁 <code>CTRL d</code> ，那就相当于 exit 命令了。</li>
<li><code>ALT BS</code> 删除光标左边的单词</li>
<li><code>ALT d</code>  删除光标右边的单词</li>
<li><code>ALT u</code>  光标右边的单词转成大写，例如 <b>status</b> ，光标位于u， <code>ALT u</code> 后变成 <b>statUS</b></li>
<li><code>ALT l</code>  光标右边的单词转成小写</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> 查找历史命令</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><code>CTRL p</code> 上一条命令，相当于<code>TOP</code></li>
<li><code>CTRL n</code> 下一条命令，相当于<code>DOWN</code></li>
<li><code>CTRL r</code> 开启搜索模式，输入部分命令，搜索历史命令，继续 <code>CTRL r</code> 向前搜索</li>
<li><code>!!</code> 重复上一条命令，也可以 <code>!n</code> 执行任意历史命令。n 是 <code>history</code> 命令输出的命令号</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> 屏幕相关</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><code>CTRL s</code> 锁定屏幕，如果命令输出较多，屏幕在滚动，你可以用 <code>CTRL s</code> 锁定屏幕，屏幕不再滚动。用windows写程序，又习惯 <code>CTRL s</code> 的注意啦！</li>
<li><code>CTRL q</code> 解除锁定，如果你摁了 <code>CTRL s</code> ，那么除非解除锁定，否则你敲啥命令都不好使，好像死机了一样。</li>
<li><code>CTRL l</code> 清空屏幕</li>
<li><code>reset</code> 这个是命令，如果屏幕曾经出乱码导致一些异常，可以用这个命令恢复。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> 其它</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><code>ALT SHIFT #</code> 如果辛苦敲了好长一条命令A，但是发现执行之前，需要先执行一条命令B。你可以用<code>CTRL c</code> 终止A的编辑，也可以 <code>CTRL u</code> 删除A，无论哪种方式，命令A都不会出现在历史记录中，此时你需要 <code>ALT SHIFT #</code></li>
<li><code>CTRL g</code> 快捷键敲多了，难免有手抖的时候。例如你辛苦输入了好长的命令A，然后敲了没有任何意义的 <code>ALT p</code> ，命令A消失了，你可以尝试 <code>CTRL g</code> 发现命令A又出现了。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> 任务相关</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><code>CTRL c</code> 终止命令执行</li>
<li><code>CTRL z</code> 暂停命令执行，然后可以用bg把它放到后台</li>
<li><code>CTRL d</code> 表示输入结束，例如当cat命令等待输入，输入完成时</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2016-10-19 三 14:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
